{
    "confidants": [
        {
            "id": "mrMiso",
            "name": "Mr. Miso",
            "role": "Ex-HR Director",
            "buff": "recruitmentGuru",
            "buffName": "Recruitment Guru",
            "location": "Park",
            "firstAppearance": 1,
            "frequency": 1,
            "currentLevel": 0,
            "maxLevel": 5,
            "portrait": "/assets/social/mr_miso.png",
            "dialogues": [
                {
                    "level": 1,
                    "responses": [
                        "Back when I ran HR, I thought I'd seen every trick in the book. But you know, nothing compares to watching someone build something from scratch with their own hands. That’s where the real magic happens.",
                        "Wait, you were in HR? That sounds like a wild ride. Bet you’ve got stories.",
                        "Oh, it depends on the company! Mine was all spreadsheets, endless meetings, and more fake smiles than a photo booth. So I packed up and left for something real.",
                        "And now you’re just chilling in the park, scouting talent like a secret agent?",
                        "Absolutely! The park’s the best place to spot future leaders. You never know who’s going to walk by with a spark in their eye. Like you, for example."
                    ]
                },
                {
                    "level": 2,
                    "responses": [
                        "You know what really got to me? Seeing amazing people get crushed by bad systems. That’s why I’m cheering you on—because I see you trying to do things differently.",
                        "Wow, thanks… I didn’t realize I needed to hear that today.",
                        "I’ve watched so much talent go to waste. But you? You’ve got the guts to build a place where people actually matter. That’s rare.",
                        "I’m trying my best, but sometimes it feels like I’m juggling flaming noodles.",
                        "Just remember: systems are supposed to serve people, not the other way around. Keep that in mind and you’ll go far."
                    ]
                },
                {
                    "level": 3,
                    "responses": [
                        "After I quit, I lived in my car for a while. My kitchen was a camping stove, and my first customers were just folks passing by. Turns out, hunger and hope make a pretty good recipe for starting over.",
                        "You’re serious? That’s incredible! I never would’ve guessed.",
                        "It’s true! No kitchen, no permits, just a lot of late nights and a dream. People started lining up for my ramen, and suddenly, I was back in business.",
                        "So you were running a ghost kitchen before it was even a thing. That’s legendary.",
                        "Ha! With real ghosts, too. And let me tell you, nothing keeps you humble like cooking noodles in the dark with no heat."
                    ]
                },
                {
                    "level": 4,
                    "responses": [
                        "You’re starting to see it, aren’t you? The difference between someone who can grow and someone who just wants to. That’s the secret sauce.",
                        "Hiring is way harder than I thought. It’s like trying to find the perfect noodle texture—tricky!",
                        "That’s because you actually care. Most bosses just want warm bodies. You want a team. That’s special.",
                        "I still mess up, though. Sometimes I feel like I’m making it up as I go.",
                        "Good! Mistakes are the best teachers. Egos just get in the way. Keep learning, and you’ll be unstoppable."
                    ]
                },
                {
                    "level": 5,
                    "responses": [
                        "You think you’re running a noodle bar, but really, you’re running a people bar. Feed your team well, and they’ll lift you higher than you ever dreamed.",
                        "I think I finally get what you mean. It’s not just about the food, is it?",
                        "Exactly! You’re already ahead of 90% of managers out there. Most never figure that out.",
                        "So… ramen is just the bait to bring everyone together?",
                        "Bingo! And you, my friend, are cooking up a revolution—one bowl at a time."
                    ]
                }
            ]
        },
        {
            "id": "riko",
            "name": "Riko",
            "role": "Former Delivery Driver",
            "buff": "deliveryFlow",
            "buffName": "Delivery Flow",
            "location": "Downtown",
            "firstAppearance": 1,
            "frequency": 1,
            "currentLevel": 0,
            "maxLevel": 5,
            "portrait": "/assets/social/riko.png",
            "dialogues": [
                {
                    "level": 1,
                    "responses": [
                        "You’re running deliveries too? Back in my day, we dodged more potholes than customers! Every ride was an adventure—sometimes a splashy one.",
                        "Wait, you used to deliver noodles? That’s awesome! Bet you’ve got some wild stories.",
                        "Fastest in town, rain or shine. I’ve zipped through wind, protests, even a parade or two. Nothing could stop me when there was soup on the line.",
                        "I bet your reflexes are still top-notch. You look like you could dodge a flying bowl.",
                        "They have to be! I still ride like I’ve got a bowl of soup balanced on my head. Old habits die hard, you know?"
                    ]
                },
                {
                    "level": 2,
                    "responses": [
                        "Want a pro tip? Always tilt the bowl just a little uphill when you’re riding. It keeps the broth from sloshing all over the place. Trust me, it’s saved me from more than a few soggy disasters.",
                        "Seriously? That actually works? I need to try that next time.",
                        "Absolutely! Customers hate opening a bag full of soup instead of noodles. Keep it upright, and you’ll have fans for life.",
                        "Noted! You should write a book about this stuff. ‘Noodle Delivery for Ninjas’ or something.",
                        "I’ve already got a title: ‘The Zen of Zip.’ Maybe you’ll get a chapter if you keep up the good work!"
                    ]
                },
                {
                    "level": 3,
                    "responses": [
                        "One time, I had to deliver during a full-blown typhoon. My helmet was filling with rain, my brakes were shot, but I made it. The customer said it was the warmest soup they’d ever had. That tip kept me going for a week!",
                        "You’re not making that up? That’s epic! I’d have turned back for sure.",
                        "Nope, all true! Sometimes the wildest rides make the best memories. And hey, a little danger makes the soup taste better.",
                        "That’s wild. Did you ever think about quitting after a day like that?",
                        "Oh, plenty of times. But honestly? I love the chase. There’s nothing like the thrill of a perfect delivery."
                    ]
                },
                {
                    "level": 4,
                    "responses": [
                        "Delivery’s a lot like life—if you go too fast, you’ll spill everything. But if you find the right balance, you’ll get there with a smile and a full bowl.",
                        "So… I should probably stop boosting around corners, huh?",
                        "Only if you like soggy noodles and angry customers! Smooth and steady wins the race, every time.",
                        "Right. Ride smooth, serve better. Got it. Maybe I’ll even enjoy the view.",
                        "Now you’re talking! That’s the spirit of a true delivery master."
                    ]
                },
                {
                    "level": 5,
                    "responses": [
                        "You’re really nailing those runs lately. I’ve seen fewer spills and your reviews are sparkling. You’re making me proud out there!",
                        "I’m just learning from the best, you know. Watching you work is like a masterclass.",
                        "Keep your wheels straight and your mind even straighter. That’s the secret to a perfect delivery—and a happy life.",
                        "Soup first, ego later. I’ll remember that next time I’m tempted to show off.",
                        "Exactly! Now get out there and show the world what a real delivery hero looks like."
                    ]
                }
            ]
        },
        {
            "id": "yuna",
            "name": "Yuna",
            "role": "Burnout Therapist",
            "buff": "mentalClarity",
            "buffName": "Mental Clarity",
            "location": "Lake",
            "firstAppearance": 1,
            "frequency": 1,
            "currentLevel": 0,
            "maxLevel": 5,
            "portrait": "/assets/social/yuna.png",
            "dialogues": [
                {
                    "level": 1,
                    "responses": [
                        "You look like someone running on fumes. Come on, sit down with me by the lake. I brought tea—nothing fancy, but it works wonders for tired minds.",
                        "Do I really look that bad? Maybe I need more than just tea.",
                        "Worse! You blink like your brain’s buffering on slow Wi-Fi. But don’t worry, I’ve seen worse. You’re in good hands.",
                        "So, what’s your story? Are you a therapist or just a really friendly stranger with snacks?",
                        "Burnout specialist, at your service! And a huge ramen fan, so you’re in the right company."
                    ]
                },
                {
                    "level": 2,
                    "responses": [
                        "People always think rest is optional, like it’s a luxury. But you wouldn’t let your noodles boil dry, would you? Same goes for your brain.",
                        "Point taken. I guess I’ve been running on empty for a while.",
                        "Ambition is great, but your brain needs oxygen too. Give yourself a break, even if it’s just a few deep breaths.",
                        "So I just… sit here and do nothing? That feels weird.",
                        "Start there. Sometimes the best ideas come when you’re not trying so hard. Let your mind wander a bit."
                    ]
                },
                {
                    "level": 3,
                    "responses": [
                        "I once worked with someone who never stopped. Numbers always perfect, always on time. Until one day, he just didn’t show up. That’s when I realized: even the strongest need to pause.",
                        "What happened to him? Did he ever come back?",
                        "They called it ‘a personal break.’ I call it a warning sign. You can’t ignore the little cracks forever.",
                        "You think I’m close to that? I mean, I do feel pretty worn out.",
                        "Closer than you think, but also further—because you’re here, talking about it. That’s a good start."
                    ]
                },
                {
                    "level": 4,
                    "responses": [
                        "Try sitting with silence for a while. It’s amazing what you’ll hear when you’re not drowning in noise. The lake’s good for that.",
                        "You sound like a monk. Should I start meditating too?",
                        "I’m no monk! Just someone who broke once, then learned to bend instead. Flexibility is the real secret.",
                        "Guess I’m still figuring that out. Some days I feel like a pretzel.",
                        "Then you’re doing just fine. Life’s about learning to twist without snapping."
                    ]
                },
                {
                    "level": 5,
                    "responses": [
                        "I can’t stop the chaos around you, but I can help you find a little stillness in the middle of it. That’s where the magic happens.",
                        "That sounds… poetic. Maybe I should write that down.",
                        "It’s practical, too! Breathe, sleep, and let go of perfection for a while. You’ll be amazed how much lighter you feel.",
                        "I’ll give it a shot. Maybe I’ll even take a nap by the lake.",
                        "That’s the spirit! Sometimes, doing nothing is the most productive thing you can do."
                    ]
                }
            ]
        },
        {
            "id": "sensei_kuro",
            "name": "Sensei Kuro",
            "role": "Retired Accountant",
            "buff": "smartSpending",
            "buffName": "Smart Spending",
            "location": "Hypermarket",
            "firstAppearance": 1,
            "frequency": 1,
            "currentLevel": 0,
            "maxLevel": 5,
            "portrait": "/assets/social/sensei_kuro.png",
            "dialogues": [
                {
                    "level": 1,
                    "responses": [
                        "This place is pure chaos—beautiful, expensive chaos! Every aisle is a new adventure, and if you listen closely, you’ll hear the whispers of bargains and the cries of wallets everywhere.",
                        "Do you shop here a lot, or are you just here for the free samples?",
                        "Only for the best deals—and a little wisdom. These aisles are full of stories, if you know how to listen. Sometimes I come just to watch people chase discounts.",
                        "So, noodles and enlightenment go hand in hand, huh?",
                        "Exactly! A good deal and a good bowl of noodles can both change your day."
                    ]
                },
                {
                    "level": 2,
                    "responses": [
                        "People forget that money leaks through the cracks if you’re not careful. It’s like a leaky bowl—no matter how much you pour in, it never fills up.",
                        "You mean like… maintenance and repairs?",
                        "I mean like poor thinking! But yes, fix your thinking and you’ll fix your bills. A little attention goes a long way.",
                        "So, budgeting is more than just numbers? It’s a way of life?",
                        "Everything is, my friend. Even the way you choose your noodles."
                    ]
                },
                {
                    "level": 3,
                    "responses": [
                        "I once had a student who blew $10,000 on gold-plated napkin holders. He’s bankrupt now, but hey, he’s got the fanciest napkins in town!",
                        "Ouch. That’s a hard lesson. I’ll stick to paper napkins for now.",
                        "They were beautiful—utterly useless, but beautiful. Sometimes, beauty isn’t worth the price tag.",
                        "Note to self: no luxury chopsticks, either.",
                        "Unless they make your team smile! Sometimes a little silliness is worth every penny."
                    ]
                },
                {
                    "level": 4,
                    "responses": [
                        "Cut what doesn’t add value, but keep what makes your place sing. Even if it’s a weird statue in the staff room—if it brings joy, it’s worth it.",
                        "I… don’t really get it. How do I know what to keep?",
                        "You’ll figure it out. When you see your team laughing together, you’ll know you’ve found the good stuff.",
                        "So jokes and laughter are… assets on the balance sheet?",
                        "The best kind! They pay dividends in happiness."
                    ]
                },
                {
                    "level": 5,
                    "responses": [
                        "Most people chase growth like it’s the only thing that matters. Me? I chase balance. Growth without balance is just a fire waiting to happen.",
                        "But fire cooks ramen! Isn’t that a good thing?",
                        "Until it burns the noodles. Then you’re left with nothing but smoke.",
                        "Touché. I guess I’ve got a lot to learn.",
                        "You’re getting it! Keep chasing balance, and you’ll always have enough for another bowl."
                    ]
                }
            ]
        }
    ]
}